ArtShare/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "dog"], ["image_url", "fghjkl"], ["artist_id", 3], ["created_at", "2022-11-10 20:15:36.620408"], ["updated_at", "2022-11-10 20:15:36.620408"]]
---
        def create
            artwork = Artwork.new(artwork_params)
            # replace the `artwork_attributes_here` with the actual attribute keys
            if artwork.save