ArtShare/app/controllers/artwork_shares_controller.rb

    def destroy
        artwork_share = ArtworkShare.find(params[:id])
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]