ArtShare/app/controllers/users_controller.rb

    def index
        # debugger
        user_id = User.search(params[:username])
        if user_id
            render json: User.find_by(id: user_id)
        else
            render json: User.all
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" IN (SELECT "users"."id" FROM "users" WHERE (username LIKE ('k%a%u%s%h%a%l'))) LIMIT $1  [["LIMIT", 1]]

    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "dareen"], ["created_at", "2022-11-10 19:50:06.925957"], ["updated_at", "2022-11-10 19:50:06.925957"]]

    def update
        user = User.find_by(id: params[:id])

        if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "superman"], ["updated_at", "2022-11-10 19:48:49.548560"], ["id", 2]]